//HERC01XX JOB (PROG001),
//	            'EXECUTA PROG001',
//	            CLASS=A,
//	            MSGCLASS=H,
//	            REGION=8M,TIME=1440,
//	            MSGLEVEL=(1,1),
//	            NOTIFY=HERC01
//COMPILA EXEC COBOL,
//	       PROG='PROG001',
//	       BIBF='HERC01.LIBS.COBOL',
//	       BIBC='HERC01.LIBS.LOAD'